In [1]:
# import modules
import pandas as pd
import numpy as np

In [5]:
# persiapan data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

dt = pd.date_range('2024-04-28', periods=(n_rows), freq='h')
df.index = pd.to_datetime(dt, format='%d%b%y:%h:%m:%s.%f')
df = df.reset_index()

df['teks'] = list('ABCDE')
df

                index  bil_pecahan  bil_bulat teks
0 2024-04-28 00:00:00         19.0         10    A
1 2024-04-28 01:00:00          7.0         11    B
2 2024-04-28 02:00:00          9.0         17    C
3 2024-04-28 03:00:00          8.0         17    D
4 2024-04-28 04:00:00          9.0          2    E

In [6]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [7]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         19.0         10
1          7.0         11
2          9.0         17
3          8.0         17
4          9.0          2

In [8]:
df.select_dtypes(include='float')

   bil_pecahan
0         19.0
1          7.0
2          9.0
3          8.0
4          9.0

In [9]:
df.select_dtypes(include='int')

   bil_bulat
0         10
1         11
2         17
3         17
4          2

In [10]:
# memilih kolom bertipe data string atau object
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [11]:
# memilih kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2024-04-28 00:00:00
1 2024-04-28 01:00:00
2 2024-04-28 02:00:00
3 2024-04-28 03:00:00
4 2024-04-28 04:00:00

In [12]:
# memilih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         19.0         10    A
1          7.0         11    B
2          9.0         17    C
3          8.0         17    D
4          9.0          2    E